In [1]:
import pandas as pd
import numpy as np
import matplotlib .pyplot as plt
import seaborn as sns

In [8]:
data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "city":['hyd','bir','pune',np.nan]}
df=pd.DataFrame(data)

In [9]:
df

    Names  Ages  city
0     Ram   NaN   hyd
1  Laxman  23.0   bir
2     NaN  22.0  pune
3    Sita  21.0   NaN

In [6]:
df["Names"].fillna("krishna",inplace=True)
df["city"].fillna("chennai",inplace=True)

In [7]:
df

     Names  Ages     city
0      Ram   NaN      hyd
1   Laxman  23.0      bir
2  krishna  22.0     pune
3     Sita  21.0  chennai

In [11]:
df.fillna(method="pad")

    Names  Ages  city
0     Ram   NaN   hyd
1  Laxman  23.0   bir
2  Laxman  22.0  pune
3    Sita  21.0  pune

In [12]:
df.fillna(method="backfill")

    Names  Ages  city
0     Ram  23.0   hyd
1  Laxman  23.0   bir
2    Sita  22.0  pune
3    Sita  21.0   NaN

In [19]:
df.fillna(method="backfill",axis=1)

    Names  Ages  city
0     Ram   hyd   hyd
1  Laxman  23.0   bir
2    22.0  22.0  pune
3    Sita  21.0   NaN

In [20]:
df.fillna(method="pad",axis=1)

    Names  Ages  city
0     Ram   Ram   hyd
1  Laxman  23.0   bir
2     NaN  22.0  pune
3    Sita  21.0  21.0

In [22]:
mean_age=df["Ages"].mean()
mean_age

22.0

In [23]:
df["Ages"].fillna(mean_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [26]:
median_age=df["Ages"].median()
median_age

22.0

In [27]:
df["Ages"].fillna(median_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [ ]:
df.fillna()